<?xml version="1.0"?>
<WeatherForecastDaily version="2.0"><header><title>Thailand Weather and Climate News</title><description>Weather Warning and Storm announces</description><uri>https://data.tmd.go.th/api/WeatherWarningNews/v2/index.php</uri><lastBuildDate>2026-07-10 17:08:26</lastBuildDate><copyRight>Thai Meteorological Department:2566</copyRight><generator>TMDData_API Services</generator><status>200 OK</status></header><Warnings/><Warning><IssueNo>5</IssueNo><EffectStartDate>2026-07-10 17:00:00</EffectStartDate><EffectEndDate>2026-07-11 06:00:00</EffectEndDate><AnnounceDate>2026-07-10 16:13:15</AnnounceDate><TitleThai>&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE41;&#xE23;&#xE07;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19; &#xE41;&#xE25;&#xE30;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE20;&#xE32;&#xE04;&#xE43;&#xE15;&#xE49;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01; &#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE20;&#xE32;&#xE04;&#xE01;&#xE25;&#xE32;&#xE07; &#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE04;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01; (&#xE21;&#xE35;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE08;&#xE19;&#xE16;&#xE36;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 15 &#xE01;&#xE23;&#xE01;&#xE0E;&#xE32;&#xE04;&#xE21; 2569) &#xE09;&#xE1A;&#xE31;&#xE1A;&#xE17;&#xE35;&#xE48; 5 (121/2569)  </TitleThai><HeadlineThai>&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 10-15 &#xE01;.&#xE04;. 69 &#xE21;&#xE23;&#xE2A;&#xE38;&#xE21;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE40;&#xE09;&#xE35;&#xE22;&#xE07;&#xE43;&#xE15;&#xE49;&#xE17;&#xE35;&#xE48;&#xE1E;&#xE31;&#xE14;&#xE1B;&#xE01;&#xE04;&#xE25;&#xE38;&#xE21;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19; &#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22; &#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE08;&#xE30;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE2A;&#xE48;&#xE07;&#xE1C;&#xE25;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE42;&#xE14;&#xE22;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07; 2-4 &#xE40;&#xE21;&#xE15;&#xE23; &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 4 &#xE40;&#xE21;&#xE15;&#xE23; </HeadlineThai><DescriptionThai>&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 10-15 &#xE01;.&#xE04;. 69 &#xE21;&#xE23;&#xE2A;&#xE38;&#xE21;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE40;&#xE09;&#xE35;&#xE22;&#xE07;&#xE43;&#xE15;&#xE49;&#xE17;&#xE35;&#xE48;&#xE1E;&#xE31;&#xE14;&#xE1B;&#xE01;&#xE04;&#xE25;&#xE38;&#xE21;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19; &#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22; &#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE08;&#xE30;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE2A;&#xE48;&#xE07;&#xE1C;&#xE25;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE42;&#xE14;&#xE22;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07; 2-4 &#xE40;&#xE21;&#xE15;&#xE23; &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 4 &#xE40;&#xE21;&#xE15;&#xE23; &#xE2A;&#xE48;&#xE27;&#xE19;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE41;&#xE25;&#xE30;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE25;&#xE48;&#xE32;&#xE07;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07; 2-3 &#xE40;&#xE21;&#xE15;&#xE23; &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 3 &#xE40;&#xE21;&#xE15;&#xE23; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE0A;&#xE32;&#xE27;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE40;&#xE14;&#xE34;&#xE19;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE14;&#xE49;&#xE27;&#xE22;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07; &#xE41;&#xE25;&#xE30;&#xE2B;&#xE25;&#xE35;&#xE01;&#xE40;&#xE25;&#xE35;&#xE48;&#xE22;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE14;&#xE34;&#xE19;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07; &#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE40;&#xE25;&#xE47;&#xE01;&#xE04;&#xE27;&#xE23;&#xE07;&#xE14;&#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE44;&#xE27;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE42;&#xE14;&#xE22;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 11-14 &#xE01;.&#xE04;. 69 &#xE20;&#xE32;&#xE04;&#xE43;&#xE15;&#xE49;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01; &#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE20;&#xE32;&#xE04;&#xE01;&#xE25;&#xE32;&#xE07; &#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE04;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01; &#xE21;&#xE35;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE1A;&#xE32;&#xE07;&#xE41;&#xE2B;&#xE48;&#xE07; &#xE42;&#xE14;&#xE22;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE08;&#xE31;&#xE07;&#xE2B;&#xE27;&#xE31;&#xE14;&#xE23;&#xE30;&#xE19;&#xE2D;&#xE07; &#xE1E;&#xE31;&#xE07;&#xE07;&#xE32; &#xE08;&#xE31;&#xE19;&#xE17;&#xE1A;&#xE38;&#xE23;&#xE35; &#xE15;&#xE23;&#xE32;&#xE14; &#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE0D;&#xE08;&#xE19;&#xE1A;&#xE38;&#xE23;&#xE35; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07;&#xE2D;&#xE31;&#xE19;&#xE15;&#xE23;&#xE32;&#xE22;&#xE08;&#xE32;&#xE01;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE41;&#xE25;&#xE30;&#xE1D;&#xE19;&#xE17;&#xE35;&#xE48;&#xE15;&#xE01;&#xE2A;&#xE30;&#xE2A;&#xE21; &#xE0B;&#xE36;&#xE48;&#xE07;&#xE2D;&#xE32;&#xE08;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE34;&#xE14;&#xE19;&#xE49;&#xE33;&#xE17;&#xE48;&#xE27;&#xE21;&#xE09;&#xE31;&#xE1A;&#xE1E;&#xE25;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE19;&#xE49;&#xE33;&#xE1B;&#xE48;&#xE32;&#xE44;&#xE2B;&#xE25;&#xE2B;&#xE25;&#xE32;&#xE01; &#xE42;&#xE14;&#xE22;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE25;&#xE32;&#xE14;&#xE40;&#xE0A;&#xE34;&#xE07;&#xE40;&#xE02;&#xE32;&#xE43;&#xE01;&#xE25;&#xE49;&#xE17;&#xE32;&#xE07;&#xE19;&#xE49;&#xE33;&#xE44;&#xE2B;&#xE25;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE41;&#xE25;&#xE30;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE25;&#xE38;&#xE48;&#xE21;&#xE44;&#xE27;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE2D;&#xE19;&#xE36;&#xE48;&#xE07; &#xE1E;&#xE32;&#xE22;&#xE38;&#xE44;&#xE15;&#xE49;&#xE1D;&#xE38;&#xE48;&#xE19; &#x201C;&#xE1A;&#xE32;&#xE2B;&#xE27;&#xE35;&#xE48;&#x201D; (BAVI) &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE21;&#xE2B;&#xE32;&#xE2A;&#xE21;&#xE38;&#xE17;&#xE23;&#xE41;&#xE1B;&#xE0B;&#xE34;&#xE1F;&#xE34;&#xE01; &#xE21;&#xE35;&#xE41;&#xE19;&#xE27;&#xE42;&#xE19;&#xE49;&#xE21;&#xE08;&#xE30;&#xE40;&#xE04;&#xE25;&#xE37;&#xE48;&#xE2D;&#xE19;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE40;&#xE01;&#xE32;&#xE30;&#xE44;&#xE15;&#xE49;&#xE2B;&#xE27;&#xE31;&#xE19; &#xE41;&#xE25;&#xE30;&#xE02;&#xE36;&#xE49;&#xE19;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE21;&#xE13;&#xE11;&#xE25;&#xE1D;&#xE39;&#xE40;&#xE08;&#xE35;&#xE49;&#xE22;&#xE19; &#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE08;&#xE35;&#xE19;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 11&#x2013;12 &#xE01;.&#xE04;. 69 &#xE42;&#xE14;&#xE22;&#xE1E;&#xE32;&#xE22;&#xE38;&#xE19;&#xE35;&#xE49;&#xE44;&#xE21;&#xE48;&#xE40;&#xE04;&#xE25;&#xE37;&#xE48;&#xE2D;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE2A;&#xE39;&#xE48;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22;&#xE08;&#xE36;&#xE07;&#xE44;&#xE21;&#xE48;&#xE2A;&#xE48;&#xE07;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE42;&#xE14;&#xE22;&#xE15;&#xE23;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE25;&#xE31;&#xE01;&#xE29;&#xE13;&#xE30;&#xE2D;&#xE32;&#xE01;&#xE32;&#xE28;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22; &#xE41;&#xE15;&#xE48;&#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE23;&#xE2A;&#xE38;&#xE21;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE40;&#xE09;&#xE35;&#xE22;&#xE07;&#xE43;&#xE15;&#xE49;&#xE17;&#xE35;&#xE48;&#xE1B;&#xE01;&#xE04;&#xE25;&#xE38;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07;&#xE02;&#xE36;&#xE49;&#xE19; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE40;&#xE14;&#xE34;&#xE19;&#xE17;&#xE32;&#xE07;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE15;&#xE23;&#xE27;&#xE08;&#xE2A;&#xE2D;&#xE1A;&#xE2A;&#xE20;&#xE32;&#xE1E;&#xE2D;&#xE32;&#xE01;&#xE32;&#xE28;&#xE01;&#xE48;&#xE2D;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE14;&#xE34;&#xE19;&#xE17;&#xE32;&#xE07;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE44;&#xE27;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE17;&#xE31;&#xE49;&#xE07;&#xE19;&#xE35;&#xE49; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1B;&#xE25;&#xE2D;&#xE14;&#xE20;&#xE31;&#xE22;&#xE41;&#xE25;&#xE30;&#xE25;&#xE14;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE32;&#xE08;&#xE40;&#xE01;&#xE34;&#xE14;&#xE02;&#xE36;&#xE49;&#xE19; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE27;&#xE32;&#xE07;&#xE41;&#xE1C;&#xE19;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE0A;&#xE35;&#xE27;&#xE34;&#xE15;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE40;&#xE14;&#xE34;&#xE19;&#xE17;&#xE32;&#xE07;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE40;&#xE27;&#xE25;&#xE32;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07; </DescriptionThai><WebUrlThai>https://tmd.go.th/media/forecast/daily-forecast/2026-07_10_17_warning_th.pdf</WebUrlThai><ContactThai>&#xE01;&#xE23;&#xE21;&#xE2D;&#xE38;&#xE15;&#xE38;&#xE19;&#xE34;&#xE22;&#xE21;&#xE27;&#xE34;&#xE17;&#xE22;&#xE32; &#xE42;&#xE17;&#xE23;. 0-2399-4012-13 &#xE2B;&#xE23;&#xE37;&#xE2D; 1182</ContactThai><TitleEnglish>&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE41;&#xE23;&#xE07;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19; &#xE41;&#xE25;&#xE30;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE20;&#xE32;&#xE04;&#xE43;&#xE15;&#xE49;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01; &#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE20;&#xE32;&#xE04;&#xE01;&#xE25;&#xE32;&#xE07; &#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE04;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01; (&#xE21;&#xE35;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE08;&#xE19;&#xE16;&#xE36;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 15 &#xE01;&#xE23;&#xE01;&#xE0E;&#xE32;&#xE04;&#xE21; 2569) &#xE09;&#xE1A;&#xE31;&#xE1A;&#xE17;&#xE35;&#xE48; 5 (121/2569)  </TitleEnglish><HeadlineEnglish>&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 10-15 &#xE01;.&#xE04;. 69 &#xE21;&#xE23;&#xE2A;&#xE38;&#xE21;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE40;&#xE09;&#xE35;&#xE22;&#xE07;&#xE43;&#xE15;&#xE49;&#xE17;&#xE35;&#xE48;&#xE1E;&#xE31;&#xE14;&#xE1B;&#xE01;&#xE04;&#xE25;&#xE38;&#xE21;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19; &#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22; &#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE08;&#xE30;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE2A;&#xE48;&#xE07;&#xE1C;&#xE25;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE42;&#xE14;&#xE22;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07; 2-4 &#xE40;&#xE21;&#xE15;&#xE23; &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 4 &#xE40;&#xE21;&#xE15;&#xE23; </HeadlineEnglish><DescriptionEnglish>&#xE1B;&#xE23;&#xE30;&#xE01;&#xE32;&#xE28;&#xE01;&#xE23;&#xE21;&#xE2D;&#xE38;&#xE15;&#xE38;&#xE19;&#xE34;&#xE22;&#xE21;&#xE27;&#xE34;&#xE17;&#xE22;&#xE32;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07; &#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE41;&#xE23;&#xE07;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE41;&#xE25;&#xE30;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE20;&#xE32;&#xE04;&#xE43;&#xE15;&#xE49;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01; &#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE20;&#xE32;&#xE04;&#xE01;&#xE25;&#xE32;&#xE07; &#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE04;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01;(&#xE21;&#xE35;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE08;&#xE19;&#xE16;&#xE36;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 15 &#xE01;&#xE23;&#xE01;&#xE0E;&#xE32;&#xE04;&#xE21; 2569)&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE17;&#xE35;&#xE48; 5 (121/2569) ------------------------&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 10-15 &#xE01;.&#xE04;. 69 &#xE21;&#xE23;&#xE2A;&#xE38;&#xE21;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE40;&#xE09;&#xE35;&#xE22;&#xE07;&#xE43;&#xE15;&#xE49;&#xE17;&#xE35;&#xE48;&#xE1E;&#xE31;&#xE14;&#xE1B;&#xE01;&#xE04;&#xE25;&#xE38;&#xE21;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19; &#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22; &#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE08;&#xE30;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE2A;&#xE48;&#xE07;&#xE1C;&#xE25;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE25;&#xE21;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07; &#xE42;&#xE14;&#xE22;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07; 2-4 &#xE40;&#xE21;&#xE15;&#xE23; &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 4 &#xE40;&#xE21;&#xE15;&#xE23; &#xE2A;&#xE48;&#xE27;&#xE19;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE15;&#xE2D;&#xE19;&#xE1A;&#xE19;&#xE41;&#xE25;&#xE30;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE25;&#xE48;&#xE32;&#xE07;&#xE21;&#xE35;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07; 2-3 &#xE40;&#xE21;&#xE15;&#xE23; &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07;&#xE04;&#xE25;&#xE37;&#xE48;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 3 &#xE40;&#xE21;&#xE15;&#xE23; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE0A;&#xE32;&#xE27;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE30;&#xE40;&#xE25;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE32;&#xE21;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE27;&#xE44;&#xE17;&#xE22;&#xE40;&#xE14;&#xE34;&#xE19;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE14;&#xE49;&#xE27;&#xE22;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07; &#xE41;&#xE25;&#xE30;&#xE2B;&#xE25;&#xE35;&#xE01;&#xE40;&#xE25;&#xE35;&#xE48;&#xE22;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE14;&#xE34;&#xE19;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1D;&#xE19;&#xE1F;&#xE49;&#xE32;&#xE04;&#xE30;&#xE19;&#xE2D;&#xE07; &#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE40;&#xE23;&#xE37;&#xE2D;&#xE40;&#xE25;&#xE47;&#xE01;&#xE04;&#xE27;&#xE23;&#xE07;&#xE14;&#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE44;&#xE27;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE42;&#xE14;&#xE22;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 11-14 &#xE01;.&#xE04;. 69 &#xE20;&#xE32;&#xE04;&#xE43;&#xE15;&#xE49;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01; &#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE20;&#xE32;&#xE04;&#xE01;&#xE25;&#xE32;&#xE07; &#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE04;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01; &#xE21;&#xE35;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE1A;&#xE32;&#xE07;&#xE41;&#xE2B;&#xE48;&#xE07; &#xE42;&#xE14;&#xE22;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE08;&#xE31;&#xE07;&#xE2B;&#xE27;&#xE31;&#xE14;&#xE23;&#xE30;&#xE19;&#xE2D;&#xE07; &#xE1E;&#xE31;&#xE07;&#xE07;&#xE32; &#xE08;&#xE31;&#xE19;&#xE17;&#xE1A;&#xE38;&#xE23;&#xE35; &#xE15;&#xE23;&#xE32;&#xE14; &#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE0D;&#xE08;&#xE19;&#xE1A;&#xE38;&#xE23;&#xE35; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07;&#xE2D;&#xE31;&#xE19;&#xE15;&#xE23;&#xE32;&#xE22;&#xE08;&#xE32;&#xE01;&#xE1D;&#xE19;&#xE15;&#xE01;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE16;&#xE36;&#xE07;&#xE2B;&#xE19;&#xE31;&#xE01;&#xE21;&#xE32;&#xE01;&#xE41;&#xE25;&#xE30;&#xE1D;&#xE19;&#xE17;&#xE35;&#xE48;&#xE15;&#xE01;&#xE2A;&#xE30;&#xE2A;&#xE21; &#xE0B;&#xE36;&#xE48;&#xE07;&#xE2D;&#xE32;&#xE08;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE34;&#xE14;&#xE19;&#xE49;&#xE33;&#xE17;&#xE48;&#xE27;&#xE21;&#xE09;&#xE31;&#xE1A;&#xE1E;&#xE25;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE19;&#xE49;&#xE33;&#xE1B;&#xE48;&#xE32;&#xE44;&#xE2B;&#xE25;&#xE2B;&#xE25;&#xE32;&#xE01; &#xE42;&#xE14;&#xE22;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE25;&#xE32;&#xE14;&#xE40;&#xE0A;&#xE34;&#xE07;&#xE40;&#xE02;&#xE32;&#xE43;&#xE01;&#xE25;&#xE49;&#xE17;&#xE32;&#xE07;&#xE19;&#xE49;&#xE33;&#xE44;&#xE2B;&#xE25;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE41;&#xE25;&#xE30;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE25;&#xE38;&#xE48;&#xE21;&#xE44;&#xE27;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE2D;&#xE19;&#xE36;&#xE48;&#xE07; &#xE1E;&#xE32;&#xE22;&#xE38;&#xE44;&#xE15;&#xE49;&#xE1D;&#xE38;&#xE48;&#xE19; &#x201C;&#xE1A;&#xE32;&#xE2B;&#xE27;&#xE35;&#xE48;&#x201D; (BAVI) &#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE21;&#xE2B;&#xE32;&#xE2A;&#xE21;&#xE38;&#xE17;&#xE23;&#xE41;&#xE1B;&#xE0B;&#xE34;&#xE1F;&#xE34;&#xE01; &#xE21;&#xE35;&#xE41;&#xE19;&#xE27;&#xE42;&#xE19;&#xE49;&#xE21;&#xE08;&#xE30;&#xE40;&#xE04;&#xE25;&#xE37;&#xE48;&#xE2D;&#xE19;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE40;&#xE01;&#xE32;&#xE30;&#xE44;&#xE15;&#xE49;&#xE2B;&#xE27;&#xE31;&#xE19; &#xE41;&#xE25;&#xE30;&#xE02;&#xE36;&#xE49;&#xE19;&#xE1D;&#xE31;&#xE48;&#xE07;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE14;&#xE49;&#xE32;&#xE19;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE21;&#xE13;&#xE11;&#xE25;&#xE1D;&#xE39;&#xE40;&#xE08;&#xE35;&#xE49;&#xE22;&#xE19; &#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE08;&#xE35;&#xE19;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 11&#x2013;12 &#xE01;.&#xE04;. 69 &#xE42;&#xE14;&#xE22;&#xE1E;&#xE32;&#xE22;&#xE38;&#xE19;&#xE35;&#xE49;&#xE44;&#xE21;&#xE48;&#xE40;&#xE04;&#xE25;&#xE37;&#xE48;&#xE2D;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE2A;&#xE39;&#xE48;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22;&#xE08;&#xE36;&#xE07;&#xE44;&#xE21;&#xE48;&#xE2A;&#xE48;&#xE07;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE42;&#xE14;&#xE22;&#xE15;&#xE23;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE25;&#xE31;&#xE01;&#xE29;&#xE13;&#xE30;&#xE2D;&#xE32;&#xE01;&#xE32;&#xE28;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22; &#xE41;&#xE15;&#xE48;&#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE23;&#xE2A;&#xE38;&#xE21;&#xE15;&#xE30;&#xE27;&#xE31;&#xE19;&#xE15;&#xE01;&#xE40;&#xE09;&#xE35;&#xE22;&#xE07;&#xE43;&#xE15;&#xE49;&#xE17;&#xE35;&#xE48;&#xE1B;&#xE01;&#xE04;&#xE25;&#xE38;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE44;&#xE17;&#xE22;&#xE21;&#xE35;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE41;&#xE23;&#xE07;&#xE02;&#xE36;&#xE49;&#xE19; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE40;&#xE14;&#xE34;&#xE19;&#xE17;&#xE32;&#xE07;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE34;&#xE40;&#xE27;&#xE13;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE15;&#xE23;&#xE27;&#xE08;&#xE2A;&#xE2D;&#xE1A;&#xE2A;&#xE20;&#xE32;&#xE1E;&#xE2D;&#xE32;&#xE01;&#xE32;&#xE28;&#xE01;&#xE48;&#xE2D;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE14;&#xE34;&#xE19;&#xE17;&#xE32;&#xE07;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE27;&#xE31;&#xE19;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE44;&#xE27;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE17;&#xE31;&#xE49;&#xE07;&#xE19;&#xE35;&#xE49; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1B;&#xE25;&#xE2D;&#xE14;&#xE20;&#xE31;&#xE22;&#xE41;&#xE25;&#xE30;&#xE25;&#xE14;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE32;&#xE08;&#xE40;&#xE01;&#xE34;&#xE14;&#xE02;&#xE36;&#xE49;&#xE19; &#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE27;&#xE32;&#xE07;&#xE41;&#xE1C;&#xE19;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE0A;&#xE35;&#xE27;&#xE34;&#xE15;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE40;&#xE14;&#xE34;&#xE19;&#xE17;&#xE32;&#xE07;&#xE43;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE07;&#xE40;&#xE27;&#xE25;&#xE32;&#xE14;&#xE31;&#xE07;&#xE01;&#xE25;&#xE48;&#xE32;&#xE27;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07; &#xE08;&#xE36;&#xE07;&#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE15;&#xE34;&#xE14;&#xE15;&#xE32;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE32;&#xE28;&#xE08;&#xE32;&#xE01;&#xE01;&#xE23;&#xE21;&#xE2D;&#xE38;&#xE15;&#xE38;&#xE19;&#xE34;&#xE22;&#xE21;&#xE27;&#xE34;&#xE17;&#xE22;&#xE32; &#xE41;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE15;&#xE34;&#xE14;&#xE15;&#xE32;&#xE21;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE17;&#xE35;&#xE48;&#xE40;&#xE27;&#xE47;&#xE1A;&#xE44;&#xE0B;&#xE15;&#xE4C;&#xE01;&#xE23;&#xE21;&#xE2D;&#xE38;&#xE15;&#xE38;&#xE19;&#xE34;&#xE22;&#xE21;&#xE27;&#xE34;&#xE17;&#xE22;&#xE32; http://www.tmd.go.th &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE17;&#xE35;&#xE48; 0-2399-4012-13 &#xE41;&#xE25;&#xE30; 1182 &#xE44;&#xE14;&#xE49;&#xE15;&#xE25;&#xE2D;&#xE14; 24 &#xE0A;&#xE31;&#xE48;&#xE27;&#xE42;&#xE21;&#xE07; &#xE1B;&#xE23;&#xE30;&#xE01;&#xE32;&#xE28; &#xE13; &#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 10 &#xE01;&#xE23;&#xE01;&#xE0E;&#xE32;&#xE04;&#xE21; &#xE1E;.&#xE28;. 2569 &#xE40;&#xE27;&#xE25;&#xE32; 17.00 &#xE19;. &#xE01;&#xE23;&#xE21;&#xE2D;&#xE38;&#xE15;&#xE38;&#xE19;&#xE34;&#xE22;&#xE21;&#xE27;&#xE34;&#xE17;&#xE22;&#xE32;&#xE08;&#xE30;&#xE2D;&#xE2D;&#xE01;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE32;&#xE28;&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE15;&#xE48;&#xE2D;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE27;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48; 11 &#xE01;&#xE23;&#xE01;&#xE0E;&#xE32;&#xE04;&#xE21; &#xE1E;.&#xE28;. 2569 &#xE40;&#xE27;&#xE25;&#xE32; 05.00 &#xE19;. (&#xE25;&#xE07;&#xE0A;&#xE37;&#xE48;&#xE2D;) &#xE19;&#xE31;&#xE10;&#xE27;&#xE38;&#xE12;&#xE34; &#xE41;&#xE14;&#xE19;&#xE14;&#xE35; (&#xE19;&#xE32;&#xE22;&#xE19;&#xE31;&#xE10;&#xE27;&#xE38;&#xE12;&#xE34; &#xE41;&#xE14;&#xE19;&#xE14;&#xE35;) &#xE23;&#xE2D;&#xE07;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE14;&#xE35; &#xE1D;&#xE48;&#xE32;&#xE22;&#xE27;&#xE34;&#xE0A;&#xE32;&#xE01;&#xE32;&#xE23; &#xE23;&#xE31;&#xE01;&#xE29;&#xE32;&#xE23;&#xE32;&#xE0A;&#xE01;&#xE32;&#xE23;&#xE41;&#xE17;&#xE19;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE14;&#xE35;&#xE01;&#xE23;&#xE21;&#xE2D;&#xE38;&#xE15;&#xE38;&#xE19;&#xE34;&#xE22;&#xE21;&#xE27;&#xE34;&#xE17;&#xE22;&#xE32;</DescriptionEnglish><WebUrlEnglish>https://tmd.go.th/media/forecast/daily-forecast/2026-07_10_17_warning_th.pdf</WebUrlEnglish><ContactEnglish>TMD Tel. 0-2399-4012-13 or 1182</ContactEnglish><TitleEnglish>Strong Wind-Waves in the Andaman Sea and the Upper Gulf Heavy to Very Heavy Rain in the Central, the East and the South West Coast No.5 (121/2026)</TitleEnglish><HeadlineEnglish>During 10&#x2013;15 July 2026, the strong southwest monsoon prevails over the Andaman Sea, Thailand and the Gulf of Thailand. The strengthening wind force the waves in the upper Andaman Sea up to 2&#x2013;4 meters. </HeadlineEnglish><DescriptionEnglish>During 10&#x2013;15 July 2026, the strong southwest monsoon prevails over the Andaman Sea, Thailand and the Gulf of Thailand. The strengthening wind force the waves in the upper Andaman Sea up to 2&#x2013;4 meters. In the upper Gulf and the lower Andaman Sea, the wave are likely 2-3 meters and above 3 meters high in thundershowers. All ships in the Andaman Sea and the Gulf should proceed with caution and keep off thundershowers, small boats should keep ashore.During 11&#x2013;14 July 2026, Isolated heavy to very heavy rain are likely in the South west coast, the western part of the Central and the East. People in these areas should beware of heavy to very heavy rain and accumulation that may cause flash floods, overflows and landslides especially along the waterways near foothills and lowlands.In addition, typhoon &#x201C;BAVI&#x201D; over Pacific Ocean is expected to move through Taiwan and make landfall over the east of Fujian district, China during 11&#x2013;12 July 2026. This storm will not move to Thailand and no direct effect on Thailand&#x2019;s weather but induced the strengthening southwest monsoon prevails over Thailand. The travelers should check the weather forecast for the region you're going to be visiting. </DescriptionEnglish><WebUrlEnglish>https://tmd.go.th/media/forecast/daily-forecast/2026-07_10_17_warning_en.pdf</WebUrlEnglish><ContactEnglish>TMD Tel. 0-2399-4012-13 or 1182</ContactEnglish></Warning></WeatherForecastDaily>
